benchmarks/server-1/raw_results.txt
==== Run 1 ====
command: siege -c 5 -b -r 3200
uptime: 00:12:27 up 159 days, 5:29, 2 users, load average: 0.00, 0.00, 0.00
** SIEGE 2.66
** Preparing 5 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      922.57 secs
Data transferred:	     1236.68 MB
Response time:		        0.29 secs
Transaction rate:	       17.34 trans/sec
Throughput:		        1.34 MB/sec
Concurrency:		        4.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        1.90
Shortest transaction:	        0.00
 

real	15m22.581s
user	0m1.012s
sys	0m3.000s

==== Run 2 ====
command: siege -c 10 -b -r 1600
uptime: 00:27:50 up 159 days, 5:45, 2 users, load average: 0.06, 0.03, 0.00
** SIEGE 2.66
** Preparing 10 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      991.27 secs
Data transferred:	     1236.68 MB
Response time:		        0.62 secs
Transaction rate:	       16.14 trans/sec
Throughput:		        1.25 MB/sec
Concurrency:		        9.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        4.28
Shortest transaction:	        0.00
 

real	16m31.280s
user	0m1.228s
sys	0m3.628s

==== Run 3 ====
command: siege -c 20 -b -r 800
uptime: 00:44:21 up 159 days, 6:01, 2 users, load average: 0.00, 0.02, 0.00
** SIEGE 2.66
** Preparing 20 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      975.91 secs
Data transferred:	     1236.68 MB
Response time:		        1.22 secs
Transaction rate:	       16.39 trans/sec
Throughput:		        1.27 MB/sec
Concurrency:		       19.98
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	       15.22
Shortest transaction:	        0.00
 

real	16m15.932s
user	0m1.128s
sys	0m3.492s

==== Run 4 ====
command: siege -c 100 -b -r 320
uptime: 01:09:21 up 159 days, 6:26, 2 users, load average: 0.00, 0.01, 0.00
** SIEGE 2.66
** Preparing 100 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       32000 hits
Availability:		      100.00 %
Elapsed time:		     1945.60 secs
Data transferred:	     2473.36 MB
Response time:		        6.07 secs
Transaction rate:	       16.45 trans/sec
Throughput:		        1.27 MB/sec
Concurrency:		       99.87
Successful transactions:       32000
Failed transactions:	           0
Longest transaction:	       47.54
Shortest transaction:	        0.00
 

real	32m25.603s
user	0m2.076s
sys	0m6.552s